** GPG
#+BEGIN_SRC emacs-lisp
(require 'epa-file)
(custom-set-variables '(epg-gpg-program  "/usr/local/bin/gpg"))
(epa-file-enable)
#+END_SRC

#+RESULTS:
: ‘epa-file’ already enabled

** org-capture
Capture high-level information for projects.
#+BEGIN_SRC emacs-lisp
(global-set-key "\C-cc" 'org-capture)

(setq org-capture-templates
      '(
        ("5" "5217" entry (file+datetree "~/Scriptorium/barton/System/data/5217_log.org")
	 (file "~/.emacs.d/org-templates/5217.orgtmpl"))
        ("d" "daily" entry (file+datetree "~/Scriptorium/barton/System/data/daily_log.org")
	 (file "~/.emacs.d/org-templates/daily.orgtmpl"))
        ("j" "journal" plain (file "~/Scriptorium/barton/journal.org.gpg")
	 (file "~/.emacs.d/org-templates/journal.orgtmpl"))

	("i" "inkvolt" entry (file+datetree "~/Scriptorium/barton/System/data/inkvolt_log.org")
	 (file "~/.emacs.d/org-templates/inkvolt.orgtmpl"))
))

#+END_SRC

#+RESULTS:
| 5 | 5217    | entry | (file+datetree ~/Scriptorium/barton/System/data/5217_log.org)    | (file ~/.emacs.d/org-templates/5217.orgtmpl)    |
| d | daily   | entry | (file+datetree ~/Scriptorium/barton/System/data/daily_log.org)   | (file ~/.emacs.d/org-templates/daily.orgtmpl)   |
| j | journal | plain | (file ~/Scriptorium/barton/journal.org.gpg)                      | (file ~/.emacs.d/org-templates/journal.orgtmpl) |
| i | inkvolt | entry | (file+datetree ~/Scriptorium/barton/System/data/inkvolt_log.org) | (file ~/.emacs.d/org-templates/inkvolt.orgtmpl) |

* Scriptorium
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c s") (lambda () (interactive) (dired "~/Scriptorium/")))
(setq initial-buffer-choice (concat "~/Scriptorium/" system-name))
#+END_SRC

#+RESULTS:
: #<buffer learn>

